tap "sinelaw/fresh"
tap "veirt/veirt"
brew "awscli"
brew "bat"
brew "btop"
brew "chezmoi"
brew "direnv"
brew "fd"
brew "fish"
brew "fresh-editor"
brew "fzf"
brew "gh"
brew "tmux"
brew "gitmux"
brew "gnu-tar"
brew "htop"
brew "lazygit"
brew "libpq"
brew "luarocks"
brew "neovim"
brew "railway"
brew "rbenv"
brew "ripgrep"
brew "unzip"
brew "wget"
brew "zoxide"
brew "veirt/veirt/weathr"
cask "1password-cli"
cask "appcleaner"
cask "backblaze"
cask "codex"
cask "cursor"
cask "docker-desktop"
cask "firefox"
cask "ghostty"
cask "loom"
cask "obsidian"
cask "rectangle"
cask "signal"
cask "tableplus"
cask "transmit"
vscode "anysphere.cursorpyright"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "eseom.nunjucks-template"
vscode "firsttris.vscode-jest-runner"
vscode "matthewpi.caddyfile-support"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "streetsidesoftware.code-spell-checker"
